{"title":"Was ist die \"Dust-Protection\"?","slug":"2021-04-09_dust","html":"<p>Da IOTA &quot;feeless&quot;, also gebührenfrei ist, und man Mikrotransaktionen senden kann also zum Beipsiel 1 IOTA, können Angreifer damit das Netzwerk sehr einfach &quot;zuspammen&quot;. Dies bezeichnen wir als &quot;Dust&quot;, also &quot;Staub&quot;. Um dies zu vermeiden, erlauben wir nur Mikrotransaktionen unter 1Mi IOTA-Token an eine andere Adresse, wenn Sie bereits mit mindestens 1Mi aufgaladen wurde.</p>\n<h2 id=\"wie-funktioniert-das\">Wie funktioniert das?</h2>\n<p>Die Dust Protection ist fest im Kernprotokoll verankert.</p>\n<p>Jede Node muss den Kontostand jeder einzelnen adresse (abgesehen von null wert adressen) - kennen. Ansonsten könnte man ja mehr Geld ausgeben als man hat, der klassische <code>double spent</code>. </p>\n<p>Diesen Umstand könnte man jedoch als Angriffsvektor nutzen, in dem man einfach ganz viele Adressen mit jeweils 1i value &quot;auflädt&quot;, denn dann müssten alle diese Adressen vom gesamten Netzwerk gespeichert werden, und so würde der Speicherbedarf den jede Node grundsätzlich braucht (selbst ohne die aktuelle Historie aller Transaktionen zu sichern) bereits ins Unermessliche wachsen. Um das Ganze noch einmal zu verdeutlichen, mit 1Mi (gegenwert zum zeitpunkt dieses Artikels in etwa 1,40$) - könnte man bereits eine Million adressen mit jeweils einem iota &quot;Dusten&quot;, und diese müssten für immer alle von allen Nodes gesichert werden. Dies wird deutlich teuerer für einen Angreifer - und somit faktisch nicht &quot;bezahlbar&quot; mit der einführung einer &quot;minimum balance&quot;, also einem minimalem Guthaben das jede Adresse haben muss nach Chrysalis. Genau genommen liegt dieser Wert bei mindestens einem Mega Iota pro Adresse. </p>\n<p>Jedoch wird es dadurch nicht unmöglich auch kleinere Beträge zu senden. Denn sobald eine Adresse diese minimale Anzahl an Wert besitzt, kann man damit 10 kleinere Transaktionen von beliebiger höhe empfangen, bis man wieder den Mindestwert aufladen muss. Jedoch ist hierfür noch weiterer Handlungsbedarf nötig - man muss so genannte <code>&quot;SigLockedDustAllowanceOutputs&quot;</code> freischalten.</p>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/iotaledger/protocol-rfcs/pull/32\">RFC Link (auf English)</a></p>\n","date":"2021-04-09","excerpt":"\nder sicherheitsmechanismus gegen Staub einfach erklärt!\n\n\n","printDate":"April 9, 2021","printReadingTime":"2 min read"}